## **Pandas Library - Continuation - Operations**

In [85]:
import numpy as np
import pandas as pd

In [86]:
df = pd.DataFrame({'C1':[1,2,3,4],
                   'C2':[222,333,444,222],
                   'C3':['as','es','is','os']})
df

   C1   C2  C3
0   1  222  as
1   2  333  es
2   3  444  is
3   4  222  os

In [87]:
df['C3'].unique()

array(['as', 'es', 'is', 'os'], dtype=object)

In [88]:
# If you want to know the number of values ​​in the column, just do:
len(df['C3'].unique())

4

In [89]:
# You can also do the following:
df['C3'].nunique()

4

In [90]:
# To know the number of times a certain value appears:
df['C2'].value_counts()

C2
222    2
333    1
444    1
Name: count, dtype: int64

In [91]:
df[df['C1']>1]

   C1   C2  C3
1   2  333  es
2   3  444  is
3   4  222  os

In [92]:
df['C1']>2

0    False
1    False
2     True
3     True
Name: C1, dtype: bool

In [93]:
# Now to join conditions:
df[(df['C1']>1) & (df['C2']==222)]

   C1   C2  C3
3   4  222  os

In [94]:
def times2(X):
    return X*2

df['C2'].sum()

1221

In [95]:
df['C1'].apply(times2)

0    2
1    4
2    6
3    8
Name: C1, dtype: int64

In [96]:
df['C3'].apply(len)

0    2
1    2
2    2
3    2
Name: C3, dtype: int64

In [97]:
# Another operations
df['C2'].apply(lambda x: x*2)

0    444
1    666
2    888
3    444
Name: C2, dtype: int64

In [98]:
df

   C1   C2  C3
0   1  222  as
1   2  333  es
2   3  444  is
3   4  222  os

In [99]:
# Returning to column removal:
#df.drop('C1', axis=1, inplace=True)
#df

In [ ]:
# You want to find columns just use:
df.columns

Index(['C1', 'C2', 'C3'], dtype='object')

In [101]:
# And index
df.index

RangeIndex(start=0, stop=4, step=1)

In [105]:
# If you want order:

df.sort_values(by='C2')

   C1   C2  C3
0   1  222  as
3   4  222  os
1   2  333  es
2   3  444  is

In [ ]:
# To know whether the values ​​are nude or not
df.isnull()

      C1     C2     C3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

* **Now let's talk about pivot tables**

In [107]:
data = {
    'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
    'B': ['one', 'one', 'two', 'two', 'one', 'one'],
    'C': ['x', 'y', 'x', 'y', 'x', 'y'],
    'D': [1, 3, 2, 5, 4, 1]
}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [108]:
df.pivot_table(values='D', index=['A', 'B'], columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN